---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SnappingService
source: html/6f58060b-3570-8e09-46c7-8f1875705f03.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SnappingService Property

Autodesk Internal: The service which provides snap points and lines

## Syntax (C#)
```csharp
public static ExternalServiceId SnappingService { get; }
```